function n = n_THz(v)
%计算铌酸锂色散折射率，针对e光入射（偏振方向和光轴平行）5% MgO 
% a1e=5.756;
% a2e=0.0983;
% a3e=0.2020;
% a4e=189.32;
% a5e=12.52;
% a6e=1.32*10^(-2);
% b1e=2.860*10^(-6);
% b2e=4.700*10^(-8);
% b3e=6.113*10^(-8);
% b4e=1.516*10^(-4);
% F=(T-24.5)*(T+570.82);
% n=sqrt(a1e+b1e*F+(a2e+b2e*F)./(lam.^2-(a3e+b3e*F)^2)+(a4e+b4e*F)./(lam.^2-a5e^2)-a6e*lam.^2);

% 计算铌酸锂色散折射率，针对e光入射（偏振方向和光轴平行）6% MgO ，15年那篇只能预测 0.3 - 1.9 THz，或者说 0 - 2 THz；
% 05年那篇可以预测 0.9~5.4 THz，99年那篇可以预测 0~0.3 THz
A=5.0;
B=2.5*10^(-2);
C=3.0*10^(-3);
n=A+B*v.^2+C*v.^4;
end

